[

    {
        "title" : "Harry Potter and the Sorcerer's Stone",
        "author" : "J.K. Rowling",
        "isbn" : 9789129675351,
        "genre" : "Action and Adventure",
        "price" : 10.99,
        "date" : "September 8, 1999",
        "rating" : 1,
        "img" : "images/pic4.jpg",
        "author_pic": "images/authors/author_1.jpg",
        "description" : "Harry Potter has no idea how famous he is. That's because he's being raised by his miserable aunt and uncle who are terrified Harry will learn that he's really a wizard, just as his parents were. But everything changes when Harry is summoned to attend an infamous school for wizards, and he begins to discover some clues about his illustrious birthright.",
        "publishing_info" : "Scholastic; 1st Edition edition",
        "author_info" : "J.K. Rowling is the author of the record-breaking, multi-award-winning Harry Potter novels. Loved by fans around the world, the series has sold more than 500 million copies, been translated into over 80 different languages and made into eight blockbuster films. "
    },
    {
        "title" : "Crazy Rich Asians",
        "author" : "Kevin Kwan",
        "isbn" : 9872412894368,
        "genre" : "Romance",
        "price" : 9.95,
        "date" : "May 20, 2014",
        "rating" : 1,
        "img" : "images/pic2.jpg",
        "author_pic": "images/authors/author_2.jpg",
        "description" : "When New Yorker Rachel Chu agrees to spend the summer in Singapore with her boyfriend, Nicholas Young, she envisions a humble family home and quality time with the man she hopes to marry. But Nick has failed to give his girlfriend a few key details. One, that his childhood home looks like a palace; two, that he grew up riding in more private planes than cars; and three, that he just happens to be the country’s most eligible bachelor.",
        "publishing_info" : "Anchor; Reprint edition",
        "author_info" : "Kevin Kwan is the No. 1 New York Times bestselling author of Crazy Rich Asians, China Rich Girlfriend, and Rich People Problems. Crazy Rich Asians: The Movie will be released worldwide by Warner Bros. on August 15th, 2018. Born in Singapore, Kevin has called New York’s West Village home since 1995."
    },
    {
        "title" : "The Outsider",
        "author" : "Stephen King",
        "isbn" : 147367640167,
        "genre" : "Horror",
        "price" : 17.75,
        "date" : "May 22, 2018",
        "rating" : 1,
        "img" : "images/pic3.jpg",
        "author_pic": "images/authors/author_3.jpg",
        "description" : "An eleven-year-old boy’s violated corpse is found in a town park. Eyewitnesses and fingerprints point unmistakably to one of Flint City’s most popular citizens. He is Terry Maitland, Little League coach, English teacher, husband, and father of two girls. Detective Ralph Anderson, whose son Maitland once coached, orders a quick and very public arrest. Maitland has an alibi, but Anderson and the district attorney soon add DNA evidence to go with the fingerprints and witnesses.",
        "publishing_info" : "Scribner; First Editiion edition",
        "author_info" : "Stephen King is the author of more than fifty books, all of them worldwide bestsellers. His recent work includes The Bill Hodges Trilogy, Revival, and Doctor Sleep. His novel 11/22/63 was named a top ten book of 2011 by The New York Times Book Review and won the Los Angeles Times Book Prize for Mystery/Thriller as well as the Best Hardcover Book Award from the International Thriller Writers Association. He is the recipient of the 2003 National Book Foundation Medal for Distinguished Contribution to American Letters."
    },
    {
        "title" : "Fear: Trump in the White House",
        "author" : "Bob Woodward",
        "isbn" : 9781501175510,
        "genre" : "Politics",
        "price" : 19.47,
        "date" : "September 11, 2018",
        "rating" : 1,
        "img" : "images/pic1.jpg",
        "author_pic": "images/authors/author_4.jpg",
        "description" : "With authoritative reporting honed through eight presidencies from Nixon to Obama, author Bob Woodward reveals in unprecedented detail the harrowing life inside President Donald Trump’s White House and precisely how he makes decisions on major foreign and domestic policies. Woodward draws from hundreds of hours of interviews with firsthand sources, meeting notes, personal diaries, files and documents. The focus is on the explosive debates and the decision-making in the Oval Office, the Situation Room, Air Force One and the White House residence.",
        "publishing_info" : "Simon & Schuster 1st edition",
        "author_info" : "Bob Woodward is an associate editor of The Washington Post, where he has worked since 1971. He has shared in two Pulitzer Prizes, first in 1973 for the coverage of the Watergate scandal with Carl Bernstein, and second in 2003 as the lead reporter for coverage of the 9/11 terrorist attacks."
    },
    {
        "title" : "Cracking the Coding Interview: 189 Programming Questions and Solutions",
        "author" : "Gayle Laakmann McDowell",
        "isbn" : 9788120340077,
        "genre" : "Computers and Technology",
        "price" : 34.75,
        "date" : "July 31, 2009",
        "rating" : 1,
        "img" : "images/pic5.jpg",
        "author_pic": "images/authors/author_5.jpg",
        "description" : "Learn how to uncover the hints and hidden details in a question, discover how to break down a problem into manageable chunks, develop techniques to unstick yourself when stuck, learn (or re-learn) core computer science concepts, and practice on 189 interview questions and solutions.",
        "publishing_info" : "CareerCup; 6th edition",
        "author_info" : "Gayle Laakmann McDowell's interviewing expertise comes from vast experience on both sides of the desk. She has completed Software Engineering interviews with - and received offers from - Microsoft, Google, Amazon, Apple, IBM, Goldman Sachs, Capital IQ, and a number of other firms. Of these top companies, she has worked for Microsoft, Apple and Google, where she gained deep insight into each company's hiring practices."
    },
    {
        "title" : "A Study in Scarlet",
        "author" : "Arthur Conan Doyle",
        "isbn" : 1609420950,
        "genre" : "Literature",
        "price" : 12.9,
        "rating" : 1,
        "img" : "images/pic7.jpg",
        "author_pic": "images/authors/author_6.jpg",
        "description" : "A Study in Scarlet is an 1887 detective novel by British author Arthur Conan Doyle. Written in 1886, the story marks the first appearance of Sherlock Holmes and Dr. Watson, who would become the most famous detective duo in popular fiction. The book's title derives from a speech given by Holmes, a consulting detective, to his friend and chronicler Watson on the nature of his work, in which he describes the story's murder investigation as his \"study in scarlet\": \"There's the scarlet thread of murder running through the colourless skein of life, and our duty is to unravel it, and isolate it, and expose every inch of it.\"",
        "publishing_info" : "Alba & Tromm 2nd edition",
        "author_info" : "Arthur Ignatius Conan Doyle (22 May 1859 - 7 July 1930) was a Scottish writer and physician, most noted for creating the fictional detective Sherlock Holmes."
    },
    {
        "title" : "Sapiens: A Brief History of Humankind",
        "author" : "Yuval Noah Harari ",
        "isbn" : 9780062316110,
        "genre" : "Anthropology",
        "price" : 13.91,
        "rating" : 1,
        "img" : "images/pic8.jpg",
        "author_pic": "images/authors/author_7.jpg",
        "description" : "Sapiens: A Brief History of Humankind is a book by Yuval Noah Harari first published in Hebrew in Israel in 2011, and in English in 2014. The book surveys the history of humankind from the evolution of archaic human species in the Stone Age up to the twenty-first century, focusing on our own species of human, Homo sapiens. The account is situated within a framework provided by the natural sciences, particularly evolutionary biology.",
        "publishing_info" : "Harper Perennial; Reprint edition",
        "author_info" : "Prof. Yuval Noah Harari has a PhD in History from the University of Oxford and lectures at the Hebrew University of Jerusalem, specializing in world history. His books have been translated into 50+ languages, with 12+ million copies sold worldwide. 'Sapiens: A Brief History of Humankind' (2014) looked deep into our past, 'Homo Deus: A Brief History of Tomorrow' (2016) considered far-future scenarios, and '21 Lessons for the 21st Century' (2018) zoomed in on the biggest questions of the present moment."
    },
    {
        "title" : "Astrophysics for People in a Hurry",
        "author" : "Neil deGrasse Tyson",
        "isbn" : 9780393609394,
        "genre" : "Physics",
        "price" : 14.36,
        "rating" : 1,
        "img" : "images/pic9.jpg",
        "author_pic": "images/authors/author_8.jpg",
        "description" : "What is the nature of space and time? How do we fit within the universe? How does the universe fit within us? There’s no better guide through these mind-expanding questions than acclaimed astrophysicist and best-selling author Neil deGrasse Tyson. \nBut today, few of us have time to contemplate the cosmos. So Tyson brings the universe down to Earth succinctly and clearly, with sparkling wit, in tasty chapters consumable anytime and anywhere in your busy day.\nWhile you wait for your morning coffee to brew, for the bus, the train, or a plane to arrive, Astrophysics for People in a Hurry will reveal just what you need to be fluent and ready for the next cosmic headlines: from the Big Bang to black holes, from quarks to quantum mechanics, and from the search for planets to the search for life in the universe.",
        "publishing_info" : "W. W. Norton & Company; 1 edition",
        "author_info" : "Neil deGrasse Tyson was born in New York City the same week NASA was founded. His interest in the universe traces back to age 9, after a first visit to the Hayden Planetarium of the American Museum of Natural History. He was educated in the public schools of New York City through his graduation from the Bronx High School of Science. And after an BA in Physics from Harvard and a PhD in Astrophysics from Columbia and a Postdoctoral research fellowship at Princeton, Tyson become the Frederick P. Rose Director of the Hayden Planetarium, where he has served since 1996."
    },
    {
        "title" : "Death by Black Hole: And Other Cosmic Quandaries",
        "author" : "Neil deGrasse Tyson",
        "isbn" : 9780393350388,
        "genre" : "Astronomy",
        "price" : 12.75,
        "rating" : 1,
        "img" : "images/pic10.jpg",
        "author_pic": "images/authors/author_8.jpg",
        "description" : "Loyal readers of the monthly \"Universe\" essays in Natural History magazine have long recognized Neil deGrasse Tyson's talent for guiding them through the mysteries of the cosmos with clarity and enthusiasm. Bringing together more than forty of Tyson's favorite essays, ?Death by Black Hole? explores a myriad of cosmic topics, from what it would be like to be inside a black hole to the movie industry's feeble efforts to get its night skies right. One of America's best-known astrophysicists, Tyson is a natural teacher who simplifies the complexities of astrophysics while sharing his infectious fascination for our universe.",
        "publishing_info" : "W. W. Norton & Company; 1 edition",
        "author_info" : "Neil deGrasse Tyson was born in New York City the same week NASA was founded. His interest in the universe traces back to age 9, after a first visit to the Hayden Planetarium of the American Museum of Natural History. He was educated in the public schools of New York City through his graduation from the Bronx High School of Science. And after an BA in Physics from Harvard and a PhD in Astrophysics from Columbia and a Postdoctoral research fellowship at Princeton, Tyson become the Frederick P. Rose Director of the Hayden Planetarium, where he has served since 1996."
    },
    {
        "title" : "Pet Sematary",
        "author" : "Stephen King",
        "isbn" : 9780743412285,
        "genre" : "Suspense",
        "price" : 5.99,
        "rating" : 1,
        "img" : "images/pic11.jpg",
        "author_pic": "images/authors/author_3.jpg",
        "description" : "When Dr. Louis Creed takes a new job and moves his family to the idyllic and rural town of Ludlow, Maine, this new beginning seems too good to be true. Yet despite Ludlow’s tranquility, there’s an undercurrent of danger that exists here. Those trucks on the road outside the Creed’s beautiful old home travel by just a little too quickly, for one thing…as is evidenced by the makeshift pet cemetery out back in the nearby woods. Then there are the warnings to Louis both real and from the depths of his nightmares that he should not venture beyond the borders of this little graveyard. A blood-chilling truth is hidden there—one more terrifying than death itself, and hideously more powerful. An ominous fate befalls anyone who dares tamper with this forbidden place, as Louis is about to discover for himself…",
        "publishing_info" : "Gallery Books; Reprint edition ",
        "author_info" : "Stephen King is the author of more than fifty books, all of them worldwide bestsellers. His recent work includes The Bill Hodges Trilogy, Revival, and Doctor Sleep. His novel 11/22/63 was named a top ten book of 2011 by The New York Times Book Review and won the Los Angeles Times Book Prize for Mystery/Thriller as well as the Best Hardcover Book Award from the International Thriller Writers Association. He is the recipient of the 2003 National Book Foundation Medal for Distinguished Contribution to American Letters."
    },
    {
        "title" : "Washington Black: A novel",
        "author" : "Esi Edugyan",
        "isbn" : 9780329438350388,
        "genre" : "Historical",
        "price" : 16.76,
        "rating" : 1,
        "img" : "images/pic12.jpg",
        "author_pic": "images/authors/author_9.jpg",
        "description" : "George Washington Black, or \"Wash,\" an eleven-year-old field slave on a Barbados sugar plantation, is terrified to be chosen by his master's brother as his manservant. To his surprise, the eccentric Christopher Wilde turns out to be a naturalist, explorer, inventor, and abolitionist. Soon Wash is initiated into a world where a flying machine can carry a man across the sky, where even a boy born in chains may embrace a life of dignity and meaning--and where two people, separated by an impossible divide, can begin to see each other as human. But when a man is killed and a bounty is placed on Wash's head, Christopher and Wash must abandon everything. What follows is their flight along the eastern coast of America, and, finally, to a remote outpost in the Arctic. What brings Christopher and Wash together will tear them apart, propelling Wash even further across the globe in search of his true self. From the blistering cane fields of the Caribbean to the frozen Far North, from the earliest aquariums of London to the eerie deserts of Morocco, Washington Black tells a story of self-invention and betrayal, of love and redemption, of a world destroyed and made whole again, and asks the question, What is true freedom?",
        "publishing_info" : "Knopf 1 edition",
        "author_info" : "ESI EDUGYAN is author of the novels The Second Life of Samuel Tyne and Half-Blood Blues, which won the Scotiabank Giller Prize, was a finalist for the Man Booker Prize, the Governor General's Literary Award, the Rogers Writers' Trust Fiction Prize, and the Orange Prize. She lives in Victoria, British Columbia."
    },
    {
        "title" : "\"Surely You're Joking, Mr. Feynman!\": Adventures of a Curious Character",
        "author" : "Richard P. Feynman",
        "isbn" : 9780393355628,
        "genre" : "Physics",
        "price" : 13.21,
        "rating" : 1,
        "img" : "images/pic13.jpg",
        "author_pic": "images/authors/author_10.jpg",
        "description" : "One of the most famous science books of our time, the phenomenal national bestseller that \"buzzes with energy, anecdote and life. It almost makes you want to become a physicist\" (Science Digest).\nRichard P. Feynman, winner of the Nobel Prize in physics, thrived on outrageous adventures. In this lively work that “can shatter the stereotype of the stuffy scientist” (Detroit Free Press), Feynman recounts his experiences trading ideas on atomic physics with Einstein and cracking the uncrackable safes guarding the most deeply held nuclear secrets―and much more of an eyebrow-raising nature. In his stories, Feynman’s life shines through in all its eccentric glory―a combustible mixture of high intelligence, unlimited curiosity, and raging chutzpah.",
        "publishing_info" : "W. W. Norton & Company; 1 edition",
        "author_info" : "Richard P. Feynman was born in 1918 and grew up in Far Rockaway, New York. At the age of seventeen he entered MIT and in 1939 went to Princeton, then to Los Alamos, where he joined in the effort to build the atomic bomb. Following World War II he joined the physics faculty at Cornell, then went on to Caltech in 1951, where he taught until his death in 1988. He shared the Nobel Prize for physics in 1965, and served with distinction on the Shuttle Commission in 1986. A commemorative stamp in his name was issued by the U.S. Postal Service in 2005."
    },
    {
        "title" : "Fire & Blood: 300 Years Before A Game of Thrones (A Targaryen History) (A Song of Ice and Fire)",
        "author" : "George R. R. Martin",
        "isbn" : 9781524796280,
        "genre" : "Science Fiction & Fantasy ",
        "price" : 20.99,
        "rating" : 1,
        "img" : "images/pic14.jpg",
        "author_pic": "images/authors/author_11.jpg",
        "description" : "Centuries before the events of A Game of Thrones, House Targaryen—the only family of dragonlords to survive the Doom of Valyria—took up residence on Dragonstone. Fire & Blood begins their tale with the legendary Aegon the Conqueror, creator of the Iron Throne, and goes on to recount the generations of Targaryens who fought to hold that iconic seat, all the way up to the civil war that nearly tore their dynasty apart.\nWhat really happened during the Dance of the Dragons? Why was it so deadly to visit Valyria after the Doom? What were Maegor the Cruel’s worst crimes? What was it like in Westeros when dragons ruled the skies? These are but a few of the questions answered in this essential chronicle, as related by a learned maester of the Citadel and featuring more than eighty all-new black-and-white illustrations by artist Doug Wheatley. Readers have glimpsed small parts of this narrative in such volumes as The World of Ice & Fire, but now, for the first time, the full tapestry of Targaryen history is revealed.\nWith all the scope and grandeur of Gibbon’s The History of the Decline and Fall of the Roman Empire, Fire & Blood is the the first volume of the definitive two-part history of the Targaryens, giving readers a whole new appreciation for the dynamic, often bloody, and always fascinating history of Westeros.\n",
        "publishing_info" : "Bantam 1 edition",
        "author_info" : "George R.R. Martin sold his first story in 1971 and has been writing professionally since then. He spent ten years in Hollywood as a writer-producer, working on The Twilight Zone, Beauty and the Beast, and various feature films and television pilots that were never made. In the mid '90s he returned to prose, his first love, and began work on his epic fantasy series, A Song of Ice and Fire. He has been in the Seven Kingdoms ever since. Whenever he's allowed to leave, he returns to Santa Fe, New Mexico, where he lives with the lovely Parris, and two cats named Augustus and Caligula, who think they run the place.\nThe Editorial Alvi Books dedicated him, as a tribute and recognition, this space in Amazon in 2015.\n"
    },
    {
        "title" : "Kitchen Confidential: Adventures in the Culinary Underbelly",
        "author" : "Anthony Bourdain",
        "isbn" : 9780060899226,
        "genre" : "Cookbooks, Food & Wine",
        "price" : 9.99,
        "rating" : 1,
        "img" : "images/pic15.jpg",
        "author_pic": "images/authors/author_12.jpg",
        "description" : "A deliciously funny, delectably shocking banquet of wild-but-true tales of life in the culinary trade from Chef Anthony Bourdain, laying out his more than a quarter-century of drugs, sex, and haute cuisine—now with all-new, never-before-published material.",
        "publishing_info" : "Ecco; Updated edition",
        "author_info" : "Chef, author, and raconteur Anthony Bourdain is best known for traveling the globe on his TV show Anthony Bourdain: Parts Unknown. Somewhat notoriously, he has established himself as a professional gadfly, bête noir, advocate, social critic, and pork enthusiast, recognized for his caustic sense of humor worldwide. He is as unsparing of those things he hates, as he is evangelical about his passions./nBourdain is the author of the New York Times bestselling Kitchen Confidential and Medium Raw; A Cook's Tour; the collection The Nasty Bits; the novels Bone in the Throat and Gone Bamboo; the biography Typhoid Mary: An Urban Historical; two graphic novels, Get Jiro! and Get Jiro!: Blood and Sushi and his latest New York Times bestselling cookbook Appetites. He has written for The New Yorker, The New York Times, The Times of London, Bon Appetit, Gourmet, Vanity Fair, Lucky Peach and many other publications. In 2013, Bourdain launched his own publishing line with Ecco, Anthony Bourdain Books, an imprint of HarperCollins. He is the host of the Emmy and Peabody Award-winning docuseries Anthony Bourdain: Parts Unknown on CNN, and before that hosted Emmy award-winning No Reservations and The Layover on Travel Channel, and The Taste on ABC"
    },
    {
        "title" : "Code Girls: The Untold Story of the American Women Code Breakers of World War II",
        "author" : "Liza Mundy",
        "isbn" : 9780316439893,
        "genre" : "Women in History",
        "price" : 27.83,
        "rating" : 1,
        "img" : "images/pic16.jpg",
        "author_pic": "images/authors/author_13.jpg",
        "description" : "Recruited by the U.S. Army and Navy from small towns and elite colleges, more than ten thousand women served as codebreakers during World War II. While their brothers and boyfriends took up arms, these women moved to Washington and learned the meticulous work of code-breaking. Their efforts shortened the war, saved countless lives, and gave them access to careers previously denied to them. A strict vow of secrecy nearly erased their efforts from history; now, through dazzling research and interviews with surviving code girls, bestselling author Liza Mundy brings to life this riveting and vital story of American courage, service, and scientific accomplishment.",
        "publishing_info" : "Hachette Books; Large Print edition",
        "author_info" : "Liza Mundy is a staff writer at the Washington Post and the bestselling author of Michelle: A Biography and Everything Conceivable, among other works. She received her AB degree from Princeton University and earned an MA in English literature at the University of Virginia. She has won awards for essays, profiles, and science writing from the Sunday Magazine Editors Association, the Maryland-Delaware-DC Press Association, the American Association of Sunday and Feature Editors, The Missouri Lifestyle Journalism Awards, and the Gay and Lesbian Alliance Against Defamation. She was a 2003 Kaiser Foundation Media Fellow and a 2005 Media Fellow at the Marine Biological Laboratory in Woods Hole, Massachusetts. Mundy lives in Arlington, Virginia."
    },
    {
        "title" : "Harry Potter and the Chamber of Secrets",
        "author" : "J.K. Rowling",
        "isbn" : 9780439064872,
        "genre" : "Action and Adventure",
        "price" : 17.99,
        "rating" : 1,
        "img" : "images/pic17.jpg",
        "author_pic": "images/authors/author_1.jpg",
        "description" : "The Dursleys were so mean and hideous that summer that all Harry Potter wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he's packing his bags, Harry receives a warning from a strange, impish creature named Dobby who says that if Harry Potter returns to Hogwarts, disaster will strike.\nAnd strike it does. For in Harry's second year at Hogwarts, fresh torments and horrors arise, including an outrageously stuck-up new professor, Gilderoy Lockhart, a spirit named Moaning Myrtle who haunts the girls' bathroom, and the unwanted attentions of Ron Weasley's younger sister, Ginny.",
        "publishing_info" : "Arthur A. Levine Books; Illustrated edition",
        "author_info" : "J.K. Rowling is the author of the record-breaking, multi-award-winning Harry Potter novels. Loved by fans around the world, the series has sold more than 500 million copies, been translated into over 80 different languages and made into eight blockbuster films. "
    },
    {
        "title" : "Harry Potter and the Deathly Hallows",
        "author" : "J.K. Rowling",
        "isbn" : 9780545010221,
        "genre" : "Action and Adventure",
        "price" : 13.99,
        "rating" : 1,
        "img" : "images/pic18.jpg",
        "author_pic": "images/authors/author_1.jpg",
        "description" : "As he climbs into the sidecar of Hagrid's motorbike and takes to the skies, leaving Privet Drive for the last time, Harry Potter knows that Lord Voldemort and the Death Eaters are not far behind. The protective charm that has kept Harry safe until now is broken, but he cannot keep hiding. The Dark Lord is breathing fear into everything Harry loves and to stop him Harry will have to find and destroy the remaining Horcruxes. The final battle must begin - Harry must stand and face his enemy ...",
        "publishing_info" : "Arthur a Levine; 1st edition",
        "author_info" : "J.K. Rowling is the author of the record-breaking, multi-award-winning Harry Potter novels. Loved by fans around the world, the series has sold more than 500 million copies, been translated into over 80 different languages and made into eight blockbuster films. "
    },
    {
        "title" : "The Subtle Art of Not Giving a F*ck: A Counterintuitive Approach to Living a Good Life",
        "author" : "Mark Manson",
        "isbn" : 9780062457714,
        "genre" : "Motivational",
        "price" : 21.99,
        "rating" : 1,
        "img" : "images/pic19.jpg",
        "author_pic": "images/authors/author_14.jpg",
        "author_info" : "Mark Manson is a blogger, author and entrepreneur. He specializes in writing personal development advice that doesn't suck. His website MarkManson.net is read by over 2 million people each month. He lives in New York City.",
        "publishing_info" : "Harper 2nd Edition",
        "description" : "For decades, we’ve been told that positive thinking is the key to a happy, rich life. \"F**k positivity,\" Mark Manson says. \"Let’s be honest, shit is f**ked and we have to live with it.\" In his wildly popular Internet blog, Manson doesn’t sugarcoat or equivocate. He tells it like it is—a dose of raw, refreshing, honest truth that is sorely lacking today. The Subtle Art of Not Giving a F**k is his antidote to the coddling, let’s-all-feel-good mindset that has infected modern society and spoiled a generation, rewarding them with gold medals just for showing up.\nManson makes the argument, backed both by academic research and well-timed poop jokes, that improving our lives hinges not on our ability to turn lemons into lemonade, but on learning to stomach lemons better. Human beings are flawed and limited—\"not everybody can be extraordinary, there are winners and losers in society, and some of it is not fair or your fault.\" Manson advises us to get to know our limitations and accept them. Once we embrace our fears, faults, and uncertainties, once we stop running and avoiding and start confronting painful truths, we can begin to find the courage, perseverance, honesty, responsibility, curiosity, and forgiveness we seek."
    },
    {
        "title" : "JavaScript: The Definitive Guide: Activate Your Web Pages (Definitive Guides)",
        "author" : "David Flanagan",
        "isbn" : 978596805527,
        "genre" : "Web Design",
        "price" : 44.99,
        "rating" : 1,
        "img" : "images/pic20.jpg",
        "author_pic": "images/authors/author_15.jpg",
        "author_info" : "David Flanagan is a computer programmer who has spent much of the last 20 years writing books about programming languages. He now works at Mozilla. David lives with his wife and children in the Pacific Northwest, between the cities of Seattle and Vancouver.",
        "publishing_info" : "O'Reilly Media; 6th edition",
        "description" : "Since 1996, JavaScript: The Definitive Guide has been the bible for JavaScript programmers—a programmer's guide and comprehensive reference to the core language and to the client-side JavaScript APIs defined by web browsers.\nThe 6th edition covers HTML5 and ECMAScript 5. Many chapters have been completely rewritten to bring them in line with today's best web development practices. New chapters in this edition document jQuery and server side JavaScript. It's recommended for experienced programmers who want to learn the programming language of the Web, and for current JavaScript programmers who want to master it."
    },
    {
        "title" : "The Road to learn React: Your journey to master plain yet pragmatic React.js",
        "author" : "Robin Wieruch ",
        "isbn" : 9781720043997,
        "genre" : "Web Design",
        "price" : 9.99,
        "rating" : 1,
        "img" : "images/pic21.jpg",
        "author_pic": "images/authors/author_16.jpg",
        "author_info" : "Robin Wieruch is a German software and web engineer who is dedicated to learn and teach programming in JavaScript. After obtaining his master's degree in computer science, he continued learning every day on his own. He gained experience from the startup world where he used JavaScript excessively during his professional time and spare time. It gave him the opportunity to teach others about these topics.\nFor a few years, Robin worked closely with a great team of engineers at a company called Small Improvements developing large scale applications. The company offers a SaaS product that enables the customers to give feedback to their companies. This application is developed using JavaScript in the frontend and Java in the backend. In the frontend, the first iteration was written in Java with the Wicket Framework and jQuery. When the first generation of SPAs became popular, the company migrated to Angular 1.x for the frontend application. After using Angular for more than two years, it became clear that Angular wasn't the best solution to work with state intense applications back in the days. That's why the company made the final jump to React and Redux that has enabled it to operate on a large scale successfully",
        "publishing_info" : "Independently published",
        "description" : "The Road to learn React teaches you the fundamentals of React. You will build a real world application along the way in plain React without complicated tooling. Everything from project setup to deployment on a server will be explained. The book comes with additional referenced reading material and exercises with each chapter. After reading the book, you will be able to build your own applications in React. The material is kept up to date by me and the community. In the Road to learn React, I want to offer a foundation before you start to dive into the broader React ecosystem. It has less tooling and less external state management, but a lot of information around React. It explains general concepts, patterns and best practices in a real world React application. You will learn to build your own React application. It covers real world features like pagination, client-side caching and interactions like searching and sorting. Additionally you will transition from JavaScript ES5 to JavaScript ES6 along the way. I hope this book captures my enthusiasm for React and JavaScript and helps you to get started."
    }


]
